Revit 2024 API
IGetLocalPathForOpenCallback Members
The IGetLocalPathForOpenCallback type exposes the following members.
Methods
Name | Description
GetLocalPathForOpen
 Implement this method to specify the local path from where a copy of a Revit link external resource can be opened for modification without interfering with its use as a link in other open documents.
See Also
IGetLocalPathForOpenCallback Interface
Autodesk.Revit.DB Namespace